#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
data.aws_route53_zone.zone: Reading...
data.aws_iam_policy_document.cloudfront_policy: Reading...
data.aws_iam_policy_document.cloudfront_policy: Read complete after 0s [id=1010772830]
data.aws_caller_identity.current: Read complete after 0s [id=590183664238]
data.aws_route53_zone.zone: Read complete after 0s [id=Z0734546290TNA2OB7F9Y]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_acm_certificate.default will be updated in-place
  ~ resource "aws_acm_certificate" "default" {
        id                        = "arn:aws:acm:us-east-1:590183664238:certificate/042077de-8847-4189-8f11-4e3ab28379c4"
        tags                      = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.cloudfront_4xx_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "cloudfront_4xx_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:590183664238:weathersense-cloudfront-alert-topic",
        ]
      + alarm_description                     = "Triggers when CloudFront 4XX errors exceed 10%."
      + alarm_name                            = "Cloudwatch-4xx-Errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DistributionId" = "EL7FDHQ9QIUWK"
          + "Region"         = "Global"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "4xxErrorRate"
      + namespace                             = "AWS/Cloudfront"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.cloudfront_5xx_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "cloudfront_5xx_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:590183664238:weathersense-cloudfront-alert-topic",
        ]
      + alarm_description                     = "Triggers when CloudFront 5XX errors exceed 5%."
      + alarm_name                            = "Cloudwatch-5xx-Errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DistributionId" = "EL7FDHQ9QIUWK"
          + "Region"         = "Global"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "5xxErrorRate"
      + namespace                             = "AWS/Cloudfront"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "missing"
    }

  # aws_wafv2_web_acl.weathersense_waf will be created
  + resource "aws_wafv2_web_acl" "weathersense_waf" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF to protect Weather Sense CloudFront"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "weathersense-waf"
      + scope                       = "CLOUDFRONT"
      + tags_all                    = (known after apply)

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWS-BadInputsRuleSet"
          + priority = 2

          + action {
              + block {
                }
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "bad-inputs"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-BotControlRuleSet"
          + priority = 3

          + action {
              + block {
                }
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesBotControlRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "bot-control"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-CommonRuleSet"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "common-rules"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "weathersense-waf-metrics"
          + sampled_requests_enabled   = true
        }
    }

  # aws_wafv2_web_acl_association.weathersense_waf_attach will be created
  + resource "aws_wafv2_web_acl_association" "weathersense_waf_attach" {
      + id           = (known after apply)
      + resource_arn = "arn:aws:cloudfront::590183664238:distribution/EL7FDHQ9QIUWK"
      + web_acl_arn  = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @fidaa-mahboob, Action: `pull_request`*